In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [30]:
#load data frm csv to pandas df
TitanicData = pd.read_csv("train.csv")
TitanicData.head()
# sibSp -> # of siblijgs/spouses on the ship
# Parch -> # of parents/children
# Pclass -> ticket class
# embarked ->

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
TitanicData.shape #rows n cols

(891, 12)

In [32]:
#target var is "survived" col
# rest cols r "features"

TitanicData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [33]:
#no of missing vals in each col
TitanicData.isnull().sum()
#3 cols r missing vals

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [34]:
# # handling missing vals
# # since cabin col has ALOT of missing vals, its useless to us so we'll drop it

TitanicData= TitanicData.drop(columns='Cabin',axis=1)

In [38]:
# for age col, we'll find mean val for age. replace missing vals w it
TitanicData['Age'].fillna(TitanicData['Age'].mean(),inplace=True)

C:\Users\Muntaha\AppData\Local\Temp\ipykernel_2388\1990773078.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  TitanicData['Age'].fillna(TitanicData['Age'].mean(),inplace=True)

In [39]:
TitanicData.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [40]:
# for embarked => filled w 3 vals : S,C,Q
# replace w most repeated val
#mode val

print(TitanicData['Embarked'].mode())

0    S
Name: Embarked, dtype: object

In [42]:
print(TitanicData['Embarked'].mode()[0]) #to get just S (mode)

S

In [44]:
TitanicData['Embarked'].fillna(TitanicData['Embarked'].mode()[0],inplace=True)

C:\Users\Muntaha\AppData\Local\Temp\ipykernel_2388\1751519789.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  TitanicData['Embarked'].fillna(TitanicData['Embarked'].mode()[0],inplace=True)

In [46]:
#no missing vals
TitanicData.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64